# 五日天气预报
class ForecastServicesController < ApplicationController
	layout 'weixin'

  # 城市告警
  def city_warn

  end

  # 五日天气预报
  def five_day_weather
    # {周几 => [低温，高温，天气], ...}
		# @weathers = FiveDayWeather.get_web_message
		@weathers = {
			"4" => ["8.2", "17.7", "阴转多云"],
			"5" => ["9", "21", "阴转多云"],
			"6" => ["11", "22", "阴转多云"],
			"0" => ["13", "18", "阴转多云"],
			"1" => ["13", "22", "阴转多云"]
		}
  end

  # 生活指数
  def life_index
  	# @index = WeatherIndex.get_web_message
  	@index = {"体感指数" => ["2", "较适宜"], "穿衣指数" => ["2", "较适宜"], "洗晒指数" => ["2", "较适宜"], "户外晚间锻炼指数" => ["2", "较适宜"]}
  end

  # 空气质量
  def air_quality
    @results = {
      "儿童感冒气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "儿童哮喘气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "成人感冒气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "老人感冒气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "慢性阻塞性肺病气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]}
    }
  end

  # 健康气象
  def healthy_weather
    @results = {
      "儿童感冒气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "儿童哮喘气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "成人感冒气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "老人感冒气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]},
      "慢性阻塞性肺病气象风险" => {"今天" => ["4级", "建议"], "明天" => ["3级", "建议"]}
    }
  end
end